
def xy():
    a = 10  # 竞品优惠金额
    c = 0.5  # 比竞品多优惠c元
    n = 8  # 挂牌价
    m = 7.2  # 结算价
    w = 3  # 服务费
    t = 0.5  # 额外优惠
    h = 200/n  # 200加油多少升
    v = 7.2  # 当前用户单价
    int(h)  # 取整数

    x = v-n+(a+c+w)*n/200  # 直降x元/升
    print(x)
    # z = y+(200-200*y-a-c-w)/(p*n)
    # d = x*n  # 前p升单价
    dj = (200-a-c+t)*n/200
    y = 20  # 最高直降Y元/升
    # y = ('%.2f' % i)

    #
    sum1 = (v-x)*h+w  # 易加油满两百需付金额
    sum2 = 200-a  # 竞品满两百需付金额
    #
    if(dj < m) :
        print("活动价%s<结算价%s" % (dj, m), "不调价!!")
    else:
        print("活动价%s>=结算价%s" % (dj, m), "可以调价!!")
        print("最高直降%s元" % (y))
        if(x<y) :
            print("直降金额%s元/升,活动价为:%s" % (x, (v-x)))
        else:
            print("直降金额%s元/升,活动价为:%s" % (y, (v-y)))
        print("%s+%s=%s" % (sum1, c, sum2))

xy()