def xy():
    y = 0.4  # 后续升数优惠
    p = 8  # 前几升
    n = 8.52  # 挂牌价
    m = 7.91  # 结算价
    t = 2.5  # 额外优惠
    h = 23  # 参与活动升数
    e = 8.39  # 竞品透出价格
    r = 0.01  # 比竞品低多少价格
    int(h)  # 取整数

    x = n-e+r  # 前P升直降x元/升
    s = n-((m-t)*h-(h-p)*(n-y))/p  # 最高前p升直降s元/升
    sum1 = p*(n-x)+(h-p)*(n-y)  # 用户需付金额
    sum2 = (m-t)*h  # 用户最低支付金额
    sum3 = e*30  # 竞品需支付金额


    if(x > s) :
        print("前p升直降%s>前p升最高直降%s" % (x, s), "不调价!!")
    else:
        print("前p升直降%s<=竞品前p升最高直降%s" % (x, s), "调价!!")
        print("前%s升基于挂牌价直降%s元/升,后续升数基于挂牌价直降%s元/升计算" % (p, x, y))
        print("用户需付金额%s>用户最低支付金额%s,竞品需支付金额%s" % (sum1, sum2, sum3))
xy()